[
    {
        "id": "1",
        "title": "Mixed Reality for Remote Operations",
        "objectives": "As part of my Masters dissertation, the goal was to **enable remote operations and maintenance** in challenging environments like offshore wind farms and nuclear facilities, utilizing **Mixed Reality (MR)** and **Digital Twin (DT)** technologies. It integrated a **sensor-equipped Unmanned Ground Vehicle (UGV)**, **HoloLens 2**, and **virtual models** for **visualization and control** in a **mixed reality environment**.",
        "outcomes": "- **Proof-of-Concept System**: The project demonstrates the integration of MR and DT technologies to manage remote operations.\n- **Advanced Visualization & Control**: The use of Mixed Reality through the HoloLens device enhanced the visualization capabilities.",
        "technicalDetails": "The project focuses on utilizing MR and DT technologies, with Unity 3D for implementing DT models and C# for programming. It integrates a UGV, sensors, and HoloLens 2 within a Unity 3D environment, using ROS middleware for communication and control. A SLAM algorithm is employed for mapping facilities, and a stereoscopic camera provides real-time visuals in a virtual environment. The project also involves programming interfaces for industrial applications to enhance human-machine interaction.",
        "project_thumbnail": "/projectImages/SymbioticRobots/Unity_scene_pointcloud_Square.png",
        "project_image": "/projectImages/SymbioticRobots/Unity_scene_pointcloud_Square.png",
        "categories":["Robotics","Simulation","Mixed Reality"],
        "Skills":["C#","Python","ROS","Unity","C#","CMake","GitHub","Linux","Mixed Reality","Project Planning"],
        "links":{
            "github":"https://github.com/oscell/SymbioticRobots/tree/main",
            "youtube":"https://youtu.be/OVepy4K4ag0?si=QkeTbYrNz_GrUCbJ",
            "website":"",
            "liveDemo":""
        }
    },
    {
        "id": "2",
        "title": "Track-Record: Real-Time Face Tracking",
        "objectives": "The Track-Record project focuses on the development of a real-time face tracking system using a Raspberry Pi platform. The primary goal is to create a user-friendly, standalone product that can be easily utilized for face tracking purposes. This system is intended to be plug-and-play, simplifying the integration of face tracking technology to allow for more interactive presentations.",
        "outcomes": "- **Real-Time Face Tracking System**: Successfully built on the Raspberry Pi 3B platform, integrating a Pi Camera Module and servo motors for dynamic face detection and tracking.\n- **User Interface Development**: A graphical user interface (GUI) has been implemented, which communicates with the Raspberry Pi server, enhancing user interaction and control over the face tracking system.\n- **Standalone and User-Friendly**: The system is designed to be plug-and-play, offering ease of use and accessibility to users without extensive technical backgrounds.",
        "technicalDetails": "- **Hardware Components**: The system comprises a Raspberry Pi 3B, a 16GB SD card, Pi Camera Module 2, SG92R Servo, and other electronic components.\n- **Software and Libraries**: Utilizing CMake, OpenCV, BCM2835, and QT5 libraries.\n- **3D Printing**: Designing and 3D printing parts using SolidWorks.",
        "project_thumbnail": "/projectImages/TrackRecord/TrackRecord_thumbnail.png",
        "project_image": "/projectImages/TrackRecord/TrackRecord.png",
        "categories":["User Interface Design","Embedded Systems, Robotics","Computer Vision","Project Planning","Marketing", "Market Research"],
        "Skills":["C++", "GitHub", "OpenCV", "Raspberry Pi", "Linux", "SOLIDWORKS"],
        "links":{
            "github":"https://github.com/oscell/Track-Record",
            "instagram":"https://www.instagram.com/tracknrecordteam/",
            "youtube":"",
            "website":"",
            "liveDemo":""
        }
    },
    {
        "id": "3",
        "title": "Robocup",
        "objectives": "The RoboCup project aims to create a realistic MATLAB-based simulation of humanoid soccer using NAO6 robots. The main objective is to provide a detailed and accurate platform for strategizing and testing tactics in accordance with regulations of the RoboCup competition. This project includes ball dynamics, robot kinematics, game state analysis, and advanced path planning techniques.",
        "outcomes": "- **Humanoid Soccer Simulation**: Developed a comprehensive simulation of humanoid soccer using NAO6 robots, focusing on realistic physical dynamics of the ball and robots.\n- **Advanced Strategy Testing**: Enabled testing and analysis of soccer strategies and tactics, including dribbling, passing, and shooting.\n- **Path Planning Techniques**: Incorporated path planning algorithms like RRT (Rapidly-exploring Random Tree) and Target-Interceptor.\n- **Decision-Making System**: Developed a State flow-based decision-making system to dictate robot roles and game dynamics, adhering to court boundaries and rules.\n- **Simulation Validation and Visualization**: Provided extensive validation of the simulation through metrics and visualization, offering insights into different strategies.",
        "technicalDetails": "- **Simulation Platform**: The project uses MATLAB for simulating the RoboCup environment with NAO6 robots.\n- **Key Features**: The simulation includes ball dynamics, robot kinematics, actuators, sensing capabilities, game state determination, and role-based robot decision making.\n- **Visualization and Metrics**: Emphasis on visualization for system explainability and metrics for benchmarking and optimizing robot team performance.",
        "project_thumbnail": "/projectImages/Robocup/Nao6.png",
        "project_image": "/projectImages/Robocup/Nao6.png",
        "categories":["Robotics","Simulation","Computer Vision"],
        "Skills":["MATLAB", "ROS","Project Planning", "Project Management", "Leadership"],
        "links":{
            "github":"https://github.com/oscell/Robocup",
            "instagram":"",
            "youtube":"",
            "website":"",
            "liveDemo":""
        }
    },


    {
        "id": "4",
        "title": "Algolia Search Integration for Restaurant Reservation Website",
        "objectives": "This project aimed to enhance the search experience on a restaurant reservation website by integrating Algolia's search service. Objectives included developing a responsive search UI with React, implementing as-you-type search functionality, custom filtering options for cuisine types, and prioritizing search results based on user location.",
        "outcomes": "- **Algolia Search with React**: Built a dynamic search interface using React, integrating Algolia's search API for real-time search capabilities.\n- **Custom Filtering & Geolocation**: Developed custom filters and geolocation to enhance search relevance.\n- **Data Manipulation and Indexing**: Processed and merged disparate datasets (JSON and CSV) for Algolia indexing, enabling comprehensive search functionalities.\n- **Responsive and User-Friendly Design**: Ensured a seamless user experience across various devices with a responsive design approach.",
        "Embed": "",
        "technicalDetails": "- **React Framework**: Created an interactive user interface for the search functionality.\n- **Algolia JS Helper**: Integrated Algolia's JS Helper library for search features.\n- **Custom Components**: Created reusable React components for search results, filters, and other UI elements.\n- **Data Processing Scripts**: Developed scripts for merging and manipulating JSON and CSV data sources to create a unified Algolia search index.\n- **HTML5 Geolocation API**: Used the Geolocation API for detecting user location and customizing search results to show nearby restaurants first.",
        "project_thumbnail": "/projectImages/RestaurantSearch/mock-up.png",
        "project_image": "/projectImages/RestaurantSearch/mock-up.png",
        "categories": ["Web Development", "UI/UX Design", "Data Integration", "React Development"],
        "Skills": ["React", "HTML", "CSS", "JavaScript", "Algolia", "Data Manipulation", "UI/UX Design"],
        "links": {
          "github": "https://github.com/oscell/Restaurant-Search",
          "liveDemo": "https://oscell.github.io/Restaurant-Search/"
        }
      }
      
]